Descriptor:
  Name: AiTMInvestigation
  DisplayName: AiTM Investigation KQL Plugin
  Description: >
    Adversary-in-the-Middle security skill to get possible malicious adversary activities into the CfS. 

SkillGroups:
  - Format: KQL
    Skills:
      - Name: AiTMInvestigation
        DisplayName: AiTM Investigation
        Description: >
          Search for cookies that were first seen after OfficeHome application authentication (as seen when the user authenticated to the AiTM phishing site) and then seen being used in other applications in other countries.
        ExamplePrompt:
          - "Get possible AiTM related sign-ins correlated to OfficeHome application"
          - "Fetch OfficeHome application signins where the same cookie was used"
          - "Get OfficeHome application sign-ins where the same cookie was used"
        Inputs:
          - Name: DaysAgo
            Description: Amount of days you want to get data from
            Required: true
        Settings:
          Target: Defender
          Template: |-
            // Search for cookies that were first seen after OfficeHome application authentication (as seen when the user authenticated to the AiTM phishing site) and then seen being used in other applications in other countries.
              let OfficeHomeSessionIds = 
              AADSignInEventsBeta
              | where Timestamp > ago({{DaysAgo}}d)
              | where ErrorCode == 0
              | where ApplicationId == "4765445b-32c6-49b0-83e6-1d93765276ca" //OfficeHome application 
              | where ClientAppUsed == "Browser" 
              | where LogonType has "interactiveUser" 
              | summarize arg_min(Timestamp, Country) by SessionId;
              AADSignInEventsBeta
              | where Timestamp > ago({{DaysAgo}}d)
              | where ApplicationId != "4765445b-32c6-49b0-83e6-1d93765276ca"
              | where ClientAppUsed == "Browser" 
              | project OtherTimestamp = Timestamp, Application, ApplicationId, AccountObjectId, AccountDisplayName, OtherCountry = Country, SessionId
              | join OfficeHomeSessionIds on SessionId
              | where OtherTimestamp > Timestamp and OtherCountry != Country

      - Name: AiTMCountrySummary
        DisplayName: AiTM Investigation Summary per Country
        Description: >
          summarize for each user the countries that authenticated to the OfficeHome application and find uncommon or untrusted ones.
        ExamplePrompt:
          - "Summarize user sign-ins per country and per office home application"
          - "Summarize user sign-ins to Office Home application per country"
        Settings:
          Target: Defender
          Template: |-
            AADSignInEventsBeta 
              | where Timestamp >ago(10d) 
              | where ApplicationId == "4765445b-32c6-49b0-83e6-1d93765276ca" //OfficeHome application 
              | where ClientAppUsed == "Browser" 
              | where LogonType has "interactiveUser" 
              | summarize Countries = make_set(Country) by AccountObjectId, AccountDisplayName 
              
      - Name: AiTMBehaviorInfo
        DisplayName: Investigate user behaviors
        Description: >
          Investigate behaviors for a specific user.
        Inputs:
          - Name: AccountUpn
            Description: AccountUpn aka userPrincipalName is required
            Required: true
        ExamplePrompt:
          - "Get user behaviors"
          - "Investigate user behaviors"
        Settings:
          Target: Defender
          Template: |-
            BehaviorInfo
            | where Timestamp >ago(30d) 
            | where ServiceSource == "Microsoft Cloud App Security"
            | where AccountUpn =~ '{{AccountUpn}}'
            | join BehaviorEntities on BehaviorId
            | where EntityType contains "User" or EntityType contains "CloudApplication"
            | project Timestamp, BehaviorId, ActionType, Description, Categories, AttackTechniques, ServiceSource, AccountUpn, AccountObjectId, EntityType, EntityRole, RemoteIP, AccountName, AccountDomain, Application